# TriangulationInterface Class

---
This abstract class provides an interface for querying a triangulation structure (vertices and triangles).
SystemObject Autodesk.Revit.DBTriangulationInterface Autodesk.Revit.DBTriangulationInterfaceForTriangulatedShellComponent Autodesk.Revit.DBTriangulationInterfaceForTriangulatedSolidOrShell
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class TriangulationInterface : IDisposable

    Public Class TriangulationInterface
    	Implements IDisposable

    public ref class TriangulationInterface : IDisposable

    type TriangulationInterface =
        class
            interface IDisposable
        end
The TriangulationInterface type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the TriangulationInterface
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace